app/controllers/goals_controller.rb

  def index
    @goals = Goals.all
---
SELECT * FROM `goals`